
[Application]
==================================================

FlashBurn=FlashBurn
Upgrade Kit=Upgrade Kit

DMR FlashBurn=DMR FlashBurn
DMR FlashBurn Software=DMR FlashBurn Software
DMR UpgradeKit Software=DMR UPGRADE KIT


[Menu]
==================================================

Merge File=Merge File
Change Skin=Change Skin
Play Sound=Play Sound
Skin1=Skin1
Skin2=Skin2
Skin3=Skin3
About=About
Exit=Exit
Arm Version=Arm Version
Version R50=Version R50
Version R46=Version R46
Version R40=Version R40
Subscriber=Subscriber
Repeater=Repeater

[Report]
=====================================================

Burn=Burn
Command=Command
File=File
Select=Select
Origin=Origin
Length=Length
Extra Org=Extra Org
Extra Len=Extra Len

No=No

Radio Model=Radio Model:
Boot Version:=Boot Version:

Burning Finished!=Burning Finished!

Radio=Radio
Portable=Portable
Mobile=Mobile
Repeater=Repeater

Portable_trunking=Portable_trunking
Mobile_trunking=Mobile_trunking

Other=Other

Please input file name!=Please input file name!
Open USB failed!=Open USB failed! Please choose an usable port!
Opening file failed!=Opening file failed!
fud file format error!=fud file format error!
Reading data error!=Reading data error!
Writing data error!=Writing data error!
Checking data error!=Checking data error!
Checking Finished (OK)!=Checking Finished (OK)!
Erasing Finished!=Erasing Finished!
Upgrading Finished!=Upgrading Finished!
erasing...=erasing...

Model type select error!=Model type select error!
 file does not exist!= file does not exist!

Are you sure to burn %d files you select?=Are you sure to burn %d files you select?

 read error!= read error!

Bootloader version is low! Please upgrade it!=Bootloader version is low! Please upgrade it!
The format of [%s] is not suited!=The format of [%s] is not suited!
Browse and open upgrade file=Browse and open upgrade file

Burning Bootloader Finished. Please Reboot Radio!=Burning Bootloader Finished. Please Reboot Radio!

Restoration file of the radio SN[%s] already exists. Are you sure to restore from the file?=Restoration file of the radio SN[%s] already exists. Are you sure to restore from the file?

Upgrade Cancelled!=Upgrade Cancelled!
Read Restoration File:=Read Restoration File:

Upgrade file of the radio does not exist. Will you select one?=Upgrade file of the radio does not exist. Will you select one?

RCDB data is already saved to file, from you can restore your data when necessary.=RCDB data is already saved to file, from you can restore your data when necessary.

Please burn the cps_data or rcdb_data last for safety purpose!=Please burn the cps_data or rcdb_data last for safety purpose!

Upgrade File:=Upgrade File:

The default value of %s is not suitable!=The default value of %s is not suitable!
Are you sure to continue burn?=Are you sure to continue burn?

rcdb erasing...=rcdb erasing...

The firmware version [%s] is beyond the upgrade software!=The firmware version [%s] is beyond the upgrade software!

For Firmware Version:=For Firmware Version:

Upgrade To:=Upgrade To:

Please select file for burn!=Please select file for burn!
Note: Please use CPS to download language package after upgrade=Note: Please use CPS to download language package after upgrade


[About]
=====================================================

OK=OK
About=About
Radio Model=Radio Model

Version:=Version:
Copyright (C) 2005-2013  All Rights Reserved=Copyright (C) 2005-2016  All Rights Reserved
Hytera Communications Corporation Limited=Hytera Communications Corporation Limited
All Rights Reserved=All Rights Reserved


[Merge File]
=====================================================

Generate=Generate
Merge=Merge
Save File=Save File
Please input save file!=Please input save file!
Merge File Successed!=Merge File Successed!
Double click two reports to add or remove burn command=Double click two reports to add or remove burn command

Read=Read
Check=Check
Erase=Erase

Upgrade=Upgrade
Burn=Burn
Burn All=Burn All

Save Head Information=Save Head Information
Save Cps Data=Save Cps Data
 

More Information=More Information
Fud Information=Fud Information
File Size=File Size

Save Head=Save Head
Save CPS=Save CPS
Fud File:=Fud File:
The file already exists. overlay it?=The file already exists. overlay it?

Modify=Modify
Modify select row information=Modify select row information
Version=Version

Firmware Ver=Firmware Ver
Extern File=Extern File
Extend Name=Extend Name
[Menu]=[Menu]
USB Port=Port:



[Read]
=====================================================

Select Type=Select Type
Start Address=Start Address
Length=Length
Cancel=Cancel

Rx Radio of Repeater=Rx Radio of Repeater
File System Read Mode=File System Read Mode
RCDB Format=RCDB Format
Save Text File=Save Text File

Please input start address!=Please input start address!
Please input length!=Please input length!


[For Radio]
=====================================================

Model=Model
Model Number=Model Number
Firmware Version=Firmware Version


[Restore]
=======================================================

Restore Data=Restore Data
Restore=Restore
Delete=Delete
Add=Add
Backup Date=Backup Date
Serial Number=Serial Number
Date=Date
File Name=File Name
Path=Path
Delete the selected file [SN+ %s, Date+%s] ?=Delete the selected file [SN= %s, Date=%s] ?
Please select a record to delete!=Please select a record to delete!

Example=Example
Input Example=Input Example

Note: Upgrade for all when set is null=Note: Upgrade for all when set is null

Firmware version format is error!=Firmware version format is error!
Model number format is error!=Model number format is error!
Please input firmware version!=Please input firmware version!
Please input model number!=Please input model number!

Please input start address!=Please input start address!
Please input change data length!=Please input change data length!

have exist in merge list, please double click it to remove first!=have exist in merge list, please double click it to remove first!

No select don't save serial number and sales region when upgrade rcdb_data or cps_data or mac address of repeater!=No select don't save serial number and sales region when upgrade rcdb_data or cps_data or mac address of repeater!

Please sure change data dll is suitable when upgrade rcdb_data or cps_data!=Please sure change data dll is suitable when upgrade rcdb_data or cps_data!

Extend Name (Version)=Extend Name (Version)

All=All
Upgrade To Firmware Version=Upgrade To Firmware Version
Firmware version format is error severity!=Firmware version format is error severity!

Upgrade to firmware version format is error severity!=Upgrade to firmware version format is error severity!
Upgrade to firmware version format is error!=Upgrade to firmware version format is error!

The model number [%s] is beyond the upgrade software!=The model number [%s] is beyond the upgrade software!

The radio type [%s] is beyond the upgrade software!=The radio type [%s] is beyond the upgrade software!

Upgrade file of the radio does not exist!=Upgrade file of the radio does not exist!

Include Serial Number, Sales Region, MAC Address of Repeater, Programmed Date=Include Serial Number, Sales Region, MAC Address of Repeater, Programmed Date

Save all cps datas. example of use cps programming software=Save all cps datas. example of use cps programming software

Tuner Change use for cps_data, but cps_data not in Merge file!=Tuner Change use for cps_data, but cps_data not in Merge file!

Model number format is error severity!=Model number format is error severity!

For Radio=For Radio
For Radio2=For Radio
For Version=For Version
For Model=For Model
Tuner Change=Tuner Change

The extern file [%s] is not exist!=The extern file [%s] is not exist!

rcdb file format error!=rcdb file format error!

Can not change extern file check, please double click top grid to replace!=Can not change extern file check, please double click top grid to replace!

have exist in merge list, are you sure to replace it?=have exist in merge list, are you sure to replace it?

Extern file is not exist!=Extern file is not exist!

Reading...=Reading...
Read Finished!=Read Finished!

All Version=All Version

Please Set For Radio!=Please Set For Radio!
Because upgrade for rcdb data, please set For Model!=Because upgrade for rcdb data, please set For Model!
Note: Select rcdb_data to upgrade, the turn data of radio will lost when upgrade!=Note: Select rcdb_data to upgrade, the turn data of radio will lost when upgrade!

Note: you have not select save head information, will lost radio sn and sales region!=Note: you have not select save head information, will lost radio sn and sales region!

Number: %d=Number: %d
Software Version: =Software Version: 

The language package of portable is not match!=The language package of portable is not match!
The language package of mobile is not match!=The language package of mobile is not match!
The language package of repeater is not match!=The language package of repeater is not match!

For radio is not match!=For radio is not match!

Delete the selected file [SN+ %s, Date+%s] ?Warning: sure to restore this radio from the file before delete it!=Delete the selected file [SN: %s, Date: %s] ? Warning: sure to restore this radio from the file before delete it!

Model number of filename and rcdb is not match!=Model number of filename and rcdb is not match!
Model number of filename and for model is not match!=Model number of filename and for model is not match!
Model number of rcdb and for model is not match!=Model number of rcdb and for model is not match!


Save Cps Data <Dll For latest: =Save Cps Data <Dll For latest: 

arm_main/erasing...=arm_main/erasing...
arm_main/writing...=arm_main/writing...

dsp_boot/erasing...=dsp_boot/erasing...
dsp_boot/writing...=dsp_boot/writing...

dsp_main/erasing...=dsp_main/erasing...
dsp_main/writing...=dsp_main/writing...

dsp_main2/erasing...=dsp_main2/erasing...
dsp_main2/writing...=dsp_main2/writing...

rcdb_data/reading...=rcdb_data/reading...

cps_data/reading...=cps_data/reading...
cps_data/writing...=cps_data/writing...

bootloader/erasing...=bootloader/erasing...
bootloader/writing...=bootloader/writing...

rcdb_data/writing...=rcdb_data/writing...

english language/erasing...=english language/erasing...
english language/writing...=english language/writing...

other language package/erasing...=other language package/erasing...
other language package/writing...=other language package/writing...

gif package/erasing...=gif package/erasing...
gif package/writing...=gif package/writing...

pic_gif package/erasing...=pic_gif package/erasing...
pic_gif package/writing...=pic_gif package/writing...

fpga_code/erasing...=fpga_code/erasing...
fpga_code/writing...=fpga_code/writing...


user_defined/erasing...=user_defined/erasing...
user_defined/writing...=user_defined/writing...

arm_main(Rx)/erasing...=arm_main(Rx)/erasing...
arm_main(Rx)/writing...=arm_main(Rx)/writing...

dsp_main(Rx)/erasing...=dsp_main(Rx)/erasing...
dsp_main(Rx)/writing...=dsp_main(Rx)/writing...

dsp_boot(Rx)/erasing...=dsp_boot(Rx)/erasing...
dsp_boot(Rx)/writing...=dsp_boot(Rx)/writing...

bootloader(Rx)/erasing...=bootloader(Rx)/erasing...
bootloader(Rx)/writing...=bootloader(Rx)/writing...

read_rcdb/reading...=read_rcdb/reading...

user_defined(Rx)/erasing...=user_defined(Rx)/erasing...
user_defined(Rx)/writing...=user_defined(Rx)/writing...

voice notify package/erasing...=voice notify package/erasing...
voice notify package/writing...=voice notify package/writing...

For Repeater Subscriber To=For Repeater Subscriber To
For Portable and Mobile Subscriber To=For Portable and Mobile Subscriber To
For Portable Subscriber To=For Portable Subscriber To
For Mobile Subscriber To=For Mobile Subscriber To
For Portable and Mobile and Repeater Subscriber To=For Portable and Mobile and Repeater Subscriber To

Please input file name!=Please input file name!
Reading =Reading 

Burn Command=Burn Command

The connected radio is not repeater, but select (Rx) command, continue burn?=The connected radio is not repeater, but select (Rx) command, continue burn?

Burn Cancelled!=Burn Cancelled!
 
Burn Failed!=Burn Failed!

Are you sure to erase the [%s] data?=Are you sure to erase the [%s] data?
Erasing Finished, Please reset the radio after erase rcdb data!=Erasing Finished, Please reset the radio after erase rcdb data!

Read data finished!=Read data finished!
Read data and save file finished!=Read data and save file finished!

Checking...=Checking...

Now is burning, Are you sure to exit the programme?=Now is burning, Are you sure to exit the program?

Now is operating, Are you sure to exit the programme?=Now is operating, Are you sure to exit the programme?
Now is erasing, Are you sure to exit the programme?=Now is erasing, Are you sure to exit the programme?
Now is reading, Are you sure to exit the programme?=Now is reading, Are you sure to exit the programme?
Now is checking, Are you sure to exit the programme?=Now is checking, Are you sure to exit the programme?

Memory is not enough!=Memory is not enough!

File does not exist!=File does not exist!

Check Error Address=Check Error Address
Ingore A/S Version=Ingore A/S Version

A Version only to upgrade A Version, and S Version only to upgrade S Version, when the check not selected=A Version only to upgrade A Version, and S Version only to upgrade S Version, when the check not selected

A/S Version [%s] is beyond the upgrade software!=A/S Version [%s] is beyond the upgrade software!

For Serial Number=For Serial Number

Fud file version error!=Fud file version error!

The serial number [%s] is beyond the upgrade file!=The serial number [%s] is beyond the upgrade file!

Please input serial number!=Please input serial number!

For All Region=For All Region
For China=For China
For North America=For North America
For EMEA=For EMEA
For South America=For South America
For ASIAN=For ASIAN

Please burn the bootloader last for safety purpose!=Please burn the bootloader last for safety purpose!

Not select save cps data when select rcdb_data!=Not select save cps data when select rcdb_data!

Merge File List=Merge File List

For PDT Subscriber To=For PDT Subscriber To

The radio sn [%s] is beyond the upgrade software!=The radio sn [%s] is beyond the upgrade software!

Number=Number
Note:=Note:
The length of arm_main is 0x440000, suitable for DMR R4.5 and Later.=The length of arm_main is 0x440000, suitable for DMR R4.5 and later.

If burn arm_main of R4.0 and early, =If burn arm_main of R4.0 and early, 
Please use Flashburn V3.00.04.000 and early.=Please use Flashburn V3.00.04.000 and early.
Not Tip Later=Not Tip Later
Tips=Tips

Delete All=Delete All
From File=From File

Low Band=Low Band
High Band (For U5)=High Band (For U5)

Warning: bootloader file is not suited, be likely to dismantle radio, continue to burn?=Warning: bootloader file is not suited, be likely to dismantle radio, continue to burn?

Please Set Mode!=Please Set Mode!
Please Set Type!=Please Set Type!
Set Mode=Set Mode
Set Type=Set Type
Convention=Convention
Trunking=Trunking

Customer code is beyond the upgrade software!=Customer code is beyond the upgrade software!

Communication error! Please close the UpgradeKit and radio, retry!=Communication error! Please close the UpgradeKit and radio, retry!

Merge All=Merge All
Language=Language
Default=Default
Farsi=Farsi
Arabic=Arabic
Korean=Korean
Thai=Thai
Japanese=Japanese
Forest=Forest

SetPDTDMR=Air Interface
DefaultMode=Default Mode
PDTMode=PDT Mode
DMRMode=DMR Mode

Please upgrade system after subsrible.=Please synchronously  upgrade Trunking System with subscriber.
Not save cps data.=Please note the user codeplug parameters will  be lost after upgrading from R5.3 to R5.5.

Backup File Storage Path=Backup File Storage Path
Please select the backup file storage path!=Please select the backup file storage path!
Data has been corrupted!=Data has been corrupted!
Data has been corrupted, select the backup file!=Data has been corrupted, select the backup file!
Data conversion failed, please re-upgrade!=Data conversion failed, please re-upgrade!
Data validation fails, please re-upgrade!=Data validation fails, please re-upgrade!
Upgrade components is incorrect, please re-install the upgrade program!=Upgrade components is incorrect, please re-install the upgrade program!

[NEW]
=======================================================
JSON input data parsing failed!=JSON input data parsing failed!
Undetectable download mode USB port!=Undetectable download mode USB port!
Open USB failed!=Open USB failed!
Get bootloader version fails!=Get bootloader version fails!
Upgrade components is incorrect, please re-install the upgrade program!=Upgrade components is incorrect, please re-install the upgrade program!
Reading data error[{0}]!=Reading data error[{0}]!
RCDB file format error!=RCDB file format error!
The radio type [{0}] is beyond the upgrade software!=The radio type [{0}] is beyond the upgrade software!
The model number [{0}] is beyond the upgrade software!=The model number [{0}] is beyond the upgrade software!
The firmware version [{0}] is beyond the upgrade software!=The firmware version [{0}] is beyond the upgrade software!
Customer code is beyond the upgrade software!=Customer code is beyond the upgrade software!
Upgrade components is incorrect, please re-install the upgrade program.=Upgrade components is incorrect, please re-install the upgrade program.
Opening file [{0}] failed!=Opening file [{0}] failed!
FUD file [{0}] format error!=FUD file [{0}] format error!
Data conversion failed, please re-upgrade!=Data conversion failed, please re-upgrade!
Data validation fails, please re-upgrade!=数据校验失败，请重新升级!
The extern file [{0}] is not exist!=The extern file [{0}] is not exist!
Reading data error!=Reading data error!
Opening file [{0}] failed.=Opening file [{0}] failed.
Upgrading Finished!=Upgrading Finished!
Upgrade Failed = Upgrade Failed!
RCDB data is already saved to file, from you can restore your data when necessary.=Writing data error! RCDB data is already saved to file, from which you can restore your data when necessary.
Automatic download mode failure, please manually enter the download mode.=Automatic download mode failure, please manually enter the download mode.

arm_main/erasing...=AM/erasing...
arm_main/writing...=AM/writing...

dsp_boot/erasing...=DB/erasing...
dsp_boot/writing...=DB/writing...

dsp_main/erasing...=DM/erasing...
dsp_main/writing...=DM/writing...

rcdb_data/reading...=RD/reading...

cps_data/reading...=CD/reading...
cps_data/writing...=CD/writing...

bootloader/erasing...=BL/erasing...
bootloader/writing...=BL/writing...

bootloader_secondary/erasing...=BLS/erasing...
bootloader_secondary/writing...=BLS/writing...

rcdb_data/writing...=RD/writing...

english language/erasing...=EL/erasing...
english language/writing...=EL/writing...

other language package/erasing...=OL/erasing...
other language package/writing...=OL/writing...

gif package/erasing...=GP/erasing...
gif package/writing...=GP/writing...

pic_gif package/erasing...=PG/erasing...
pic_gif package/writing...=PG/writing...

fpga_code/erasing...=FC/erasing...
fpga_code/writing...=FC/writing...


user_defined/erasing...=erasing...
user_defined/writing...=writing...

arm_main(Rx)/erasing...=AMR/erasing...
arm_main(Rx)/writing...=AMR/writing...

dsp_main(Rx)/erasing...=DMR/erasing...
dsp_main(Rx)/writing...=DMR/writing...

dsp_main2/erasing...=DM2/erasing...
dsp_main2/writing...=DM2/writing...

dsp_boot(Rx)/erasing...=DBR/erasing...
dsp_boot(Rx)/writing...=DBR/writing...

bootloader(Rx)/erasing...=BLR/erasing...
bootloader(Rx)/writing...=BLR/writing...

bootloader_secondary(Rx)/erasing...=BLSR/erasing...
bootloader_secondary(Rx)/writing...=BLSR/writing...

read_rcdb/reading...=RR/reading...

user_defined(Rx)/erasing...=erasing...
user_defined(Rx)/writing...=writing...

voice notify package/erasing...=VN erasing...
voice notify package/writing...=VN writing...



























